@jhutchings1 @rexscaria 
Thanks for the updated.
I tested it on provider version 5.12.0 and resources is still in permanent change during each apply:

```
  # cloudflare_zero_trust_gateway_settings.general will be updated in-place
  ~ resource "cloudflare_zero_trust_gateway_settings" "general" {
      ~ created_at = "2021-07-28T08:34:54Z" -> (known after apply)
        id         = "59a5890a1087bbf769ba0d276088996b"
      ~ settings   = {
          ~ block_page              = {
                name             = ""
              + read_only        = (known after apply)
              + source_account   = (known after apply)
              ~ version          = 2 -> (known after apply)
                # (11 unchanged attributes hidden)
            }
          ~ extended_email_matching = {
              + read_only      = (known after apply)
              + source_account = (known after apply)
              ~ version        = 2 -> (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ sandbox                 = {
              + enabled         = false
              + fallback_action = "allow"
            }
            # (9 unchanged attributes hidden)
        }
      ~ updated_at = "2025-11-05T08:56:29Z" -> (known after apply)
        # (1 unchanged attribute hidden)
    }
```

Resource is:
```
resource "cloudflare_zero_trust_gateway_settings" "general" {
  account_id = var.cloudflare_account_id

  settings = {
    activity_log = {
      enabled = false
    }

    browser_isolation = {
      non_identity_enabled          = false
      url_browser_isolation_enabled = false
    }

    certificate = {
      id = "xxxxxx"
    }

    tls_decrypt = {
      enabled = false
    }

    protocol_detection = {
      enabled = false
    }

    sandbox = {
      enabled         = false
      fallback_action = "allow"
    }

    antivirus = {
      enabled_download_phase = false
      enabled_upload_phase   = false
      fail_closed            = false

      notification_settings = {
        enabled = false
      }
    }

    block_page = {
      background_color = "#ffffff"
      enabled          = false
      footer_text      = ""
      header_text      = ""
      logo_path        = ""
      mailto_address   = ""
      mailto_subject   = ""
      name             = ""
      suppress_footer  = false
      mode             = ""
      include_context  = false
      target_uri       = ""
    }

    body_scanning = {
      inspection_mode = "shallow"
    }

    extended_email_matching = {
      enabled = false
    }

    fips = {
      tls = false
    }

    host_selector = {
      enabled = false
    }
  }
}
```
